app/Livewire/CompanyLogo.php

    public function render()
    {

        if (auth()->guard('emp')->check()) {
            $employeeId = auth()->guard('emp')->user()->emp_id;
            $this->employee = DB::table('employee_details')
                ->join('companies', 'employee_details.company_id', '=', 'companies.company_id')
                ->where('employee_details.emp_id', $employeeId)
                ->select('companies.company_logo')
                ->first();
---
select `companies`.`company_logo` from `employee_details` inner join `companies` on `employee_details`.`company_id` = `companies`.`company_id` where `employee_details`.`emp_id` = 'XSS-0488' limit 1