app/Livewire/DownloadPdf.php

    public function render()
    {
        $employeeId = auth()->guard('emp')->user()->emp_id;
        $this->employeeDetails = EmployeeDetails::where('emp_id', $employeeId)->get();
        $this->salaryRevision = SalaryRevision::where('emp_id', $employeeId)->get();
        $this->empBankDetails = EmpBankDetail::where('emp_id', $employeeId)->get();
        $this->companies = Company::join('employee_details', 'companies.company_id', '=', 'employee_details.company_id')
            ->where('employee_details.emp_id', $employeeId)
            ->orderBy('employee_details.created_at', 'desc')
            ->get();
---
select * from `employee_details` where `emp_id` = 'XSS-0488'
select * from `salary_revisions` where `emp_id` = 'XSS-0488'
select * from `emp_bank_details` where `emp_id` = 'XSS-0488'
select * from `companies` inner join `employee_details` on `companies`.`company_id` = `employee_details`.`company_id` where `employee_details`.`emp_id` = 'XSS-0488' order by `employee_details`.`created_at` desc