app/Livewire/Feeds.php

select * from `comments` where `comments`.`emp_id` in (0)
select * from `employee_details` where `company_id` = 'XSS-12345'
select * from `add_comments` where `emp_id` in ('XSS-0488')
select * from `emojis` where `emp_id` in ('XSS-0488')
select * from `emoji_reactions` where `emp_id` in ('XSS-0488')
---
    public function mount()
    {

        $companyId = Auth::user()->company_id;
        // Load employees with comments
        $this->employees = EmployeeDetails::with('comments')->where('company_id', $companyId)->get();

        // Combine and sort data
        $this->combinedData = $this->combineAndSortData($this->employees);

      $this->loadComments();
       $this->loadaddComments();
       $this->addcomments = Addcomment::with('employee')->whereIn('emp_id', $this->employees->pluck('emp_id'))->get();
        $this->storedemojis = Emoji::whereIn('emp_id', $this->employees->pluck('emp_id'))->get();
        $this->emojis = EmojiReaction::whereIn('emp_id', $this->employees->pluck('emp_id'))->get();

select * from `comments` where `emp_id` in ('XSS-0488') or `hr_emp_id` in ('XSS-0488') and 0 = 1 order by `created_at` desc
---
    public function loadComments()
{
    // Fetch all comments initially
    $commentsQuery = Comment::with('employee', 'hr')
        ->whereIn('emp_id', $this->employees->pluck('emp_id'))
        ->orWhereIn('hr_emp_id', $this->employees->pluck('emp_id'));

select * from `companies` where `company_id` = 'XSS-12345' limit 1
---
    private function getEmpCompanyLogoUrl()
    {
        // Get the current authenticated employee's company ID
        if (auth()->guard('emp')->check()) {
            // Get the current authenticated employee's company ID
            $empCompanyId = auth()->guard('emp')->user()->company_id;

            // Assuming you have a Company model with a 'company_logo' attribute
            $company = Company::where('company_id', $empCompanyId)->first();

select * from `emp_personal_infos` where `emp_personal_infos`.`emp_id` in (0)
select * from `employee_details` where `emp_id` = 'XSS-0488'
select * from `emojis` where `emp_id` = 'XSS-0488'
select * from `emoji_reactions` where `emp_id` = 'XSS-0488'
---
    public function render()
    {
        // Initialize variables
        $this->employeeDetails = collect();
        $this->hr = collect();
        $storedEmojis = collect();
        $emojis = collect();

        // Check if 'emp' guard is authenticated
        if (auth()->guard('emp')->check()) {
            $this->employeeDetails = EmployeeDetails::with('personalInfo') // Eager load personal info
                ->where('emp_id', auth()->guard('emp')->user()->emp_id)
                ->get();

            $storedEmojis = Emoji::where('emp_id', auth()->guard('emp')->user()->emp_id)->get();
            $emojis = EmojiReaction::where('emp_id', auth()->guard('emp')->user()->emp_id)->get();