app/Livewire/Notification.php

select `employee_details`.`first_name`, `employee_details`.`last_name`, `notifications`.`emp_id`, `notifications`.`body` as `detail`, `notifications`.`notification_type`, `notifications`.`created_at`, `notifications`.`chatting_id`, `notifications`.`leave_type` from `notifications` inner join `employee_details` on `notifications`.`emp_id` = `employee_details`.`emp_id` where `receiver_id` = 'XSS-0488' and `notification_type` = 'message' and `message_read_at` is null
select `employee_details`.`first_name`, `employee_details`.`last_name`, `notifications`.`emp_id`, `notifications`.`leave_type` as `detail`, `notifications`.`notification_type`, `notifications`.`created_at`, `notifications`.`chatting_id`, `notifications`.`leave_type` from `notifications` inner join `employee_details` on `notifications`.`emp_id` = `employee_details`.`emp_id` where (json_contains(`notifications`.`applying_to`, '[{\"manager_id\":\"XSS-0488\"}]') or json_contains(`notifications`.`cc_to`, '[{\"emp_id\":\"XSS-0488\"}]')) and `notification_type` = 'leave' and `is_read` = 0
select `employee_details`.`first_name`, `employee_details`.`last_name`, `notifications`.`task_name` as `detail`, `notifications`.`emp_id`, `notifications`.`notification_type`, `notifications`.`created_at`, `notifications`.`chatting_id`, `notifications`.`leave_type` from `notifications` inner join `employee_details` on `notifications`.`emp_id` = `employee_details`.`emp_id` where SUBSTRING_INDEX(SUBSTRING_INDEX(notifications.assignee, '(', -1), ')', 1) = 'XSS-0488' and `notification_type` = 'task' and `is_read` = 0
---
    public function fetchNotifications()
    {
        try {
            $loggedInEmpId = Auth::guard('emp')->user()->emp_id;
            // working groupby messages notifications

            $this->messagenotifications = DB::table('notifications')
                ->join('employee_details', 'notifications.emp_id', '=', 'employee_details.emp_id')
                ->where('receiver_id', $loggedInEmpId)
                ->where('notification_type', 'message')
                ->where('message_read_at', null)
                ->select('employee_details.first_name', 'employee_details.last_name',  'notifications.emp_id',  'notifications.body as detail', 'notifications.notification_type', 'notifications.created_at','notifications.chatting_id','notifications.leave_type')
                ->get();
                // ->groupBy('emp_id');

            $this->leavenotifications = DB::table('notifications')
                ->join('employee_details', 'notifications.emp_id', '=', 'employee_details.emp_id')
                ->where(function ($query) use ($loggedInEmpId) {
                    $query->whereJsonContains('notifications.applying_to', [['manager_id' => $loggedInEmpId]])
                        ->orWhereJsonContains('notifications.cc_to', [['emp_id' => $loggedInEmpId]]);
                })
                ->where('notification_type', 'leave')
                ->where('is_read', 0)
                ->select('employee_details.first_name', 'employee_details.last_name', 'notifications.emp_id',  'notifications.leave_type as detail', 'notifications.notification_type', 'notifications.created_at','notifications.chatting_id','notifications.leave_type')
                ->get();
                // ->groupBy('emp_id');


            $this->tasknotifications = DB::table('notifications')
                ->join('employee_details', 'notifications.emp_id', '=', 'employee_details.emp_id')
                ->whereRaw("SUBSTRING_INDEX(SUBSTRING_INDEX(notifications.assignee, '(', -1), ')', 1) = ?", [$loggedInEmpId])
                ->where('notification_type', 'task')
                ->where('is_read', 0)
                ->select('employee_details.first_name', 'employee_details.last_name', 'notifications.task_name as detail', 'notifications.emp_id', 'notifications.notification_type', 'notifications.created_at','notifications.chatting_id','notifications.leave_type')
                ->get();

select count(distinct `emp_id`) as aggregate from `notifications` where `receiver_id` = 'XSS-0488' and `message_read_at` is null
---



            $this->chatNotificationCount = DB::table('notifications')
            ->where('receiver_id',$loggedInEmpId)
            ->whereNull('message_read_at')
            ->distinct('emp_id')
            ->count('emp_id');